Revit 2024 API
BuiltInFailures.OpeningFailures.ModelAlreadyCheckedOutByUser Property
 The Cloud WorkSharing Model is already checked out by the current user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ModelAlreadyCheckedOutByUser { get; }
Visual Basic
Public Shared ReadOnly Property ModelAlreadyCheckedOutByUser As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ModelAlreadyCheckedOutByUser {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace